#지역번호 튜플 만들기
zoneno = (['010', '휴대전화'], #['011', '휴대전화'], ['016', '휴대전화'],['017', '휴대전화'],['018', '휴대전화'],['019', '휴대전화'],
           ['02', ['서울특별시', '광명시', '과천시']], ['031', '경기도'], ['032', ['인천광역시', '부천시']], ['033', '강원도'],
           ['041', '충청남도'], ['042', ['대전광역시', '계룡시']], ['043', '충청북도'], ['044', '세종특별자치시'],
            ['051', '부산광역시'], ['052', '울산광역시'], ['053', ['대구광역시', '경산시']], ['054', '경상북도'],
            ['055', '경상남도'], ['061', '전라남도'], ['062', '광주광역시'], ['063', '전라북도'], ['064', '제주특별자치도'])
zoneno[0][0] = ['010', '011', '016', '017', '018', '019']   #휴대전화 지역번호 항목 추가

#지역번호 출력
for no, zone in zoneno:
    print(no, " > ", zone)

#지역번호 검색(번호로 찾기)
inno = input("전화 지역번호 입력: ")
for no, zone in zoneno:
    if type(no) is list:
        if inno in no:
            print("%s > %s" %(inno, zone))
    elif no == inno:
        print("%s > %s" %(inno, zone))

#지역번호 검색(지역으로 찾기)
inzone = input("전화번호 지역 입력: ")
for no, zone in zoneno:
    if type(zone) is list:
        if inzone in zone:
            print("%s > %s" %(inno, zone))
    elif zone == inzone:
        print("%s > %s" %(inno, zone))