#지역번호 만들기
zoneno = ([['010'], '휴대전화'],
           ['02', ['서울특별시', '광명시', '과천시']], ['031', '경기도'], ['032', ['인천광역시', '부천시']], ['033', '강원도'],
           ['041', '충청남도'], ['042', ['대전광역시', '계룡시']], ['043', '충청북도'], ['044', '세종특별자치시'],
            ['051', '부산광역시'], ['052', '울산광역시'], ['053', ['대구광역시', '경산시']], ['054', '경상북도'],
            ['055', '경상남도'], ['061', '전라남도'], ['062', '광주광역시'], ['063', '전라북도'], ['064', '제주특별자치도'])
menuno = ([0, '종료'], [1, '번호로 검색'], [2, '지역명으로 검색'])  # 메뉴를 위한 튜플 데이터

def find_no(inno):
    pass

def find_zone(inzone):
    pass

while True:
    print("\n>>번호로 선택: ", end='')
    for no, name in menuno:
        print("[%d] %s " % (no, name), end='   ')
    selnum = input("No?> ")

    # 검색 작업
    if selnum == '0':
        break
    elif selnum == '1':
        inno = input("전화 지역번호 입력: ")
        find_no(inno)  # 지역번호 검색(번호로 찾기)
    elif selnum == '2':
        inzone = input("전화번호 지역명 입력: ")
        find_zone(inzone)  # 지역번호 검색(지역명으로 찾기)