#모스 부호 만들기
code = {'A':'.-', 'B':'-....', 'C':'-.-.', 'D':'-..', 'E':'.', 'F':'..-.', 'G':'--.',
       'H':'....', 'I':'..', 'J':'.---', 'K':'-.-', 'L':'.-..', 'M':'--', 'N':'-.',
       'O':'---', 'P':'.--.', 'Q':'--.-', 'R':'.-.', 'S':'...', 'T':'-', 'U':'..-',
       'V':'...-', 'W':'.--', 'X':'-..-', 'Y':'-.--', 'Z':'--..'}


word = input("모스 부호로 표시할 단어(알파벳 대문자) : ")
word =  word.upper()
for ch in word:
    if ch in code:
        print(code.get(ch), end = " ") # 부호마다 뒤에 빈 칸 추가
    else:
        print("None", end = " ")

